[
    {
        "jobId": 1,
        "title": "Software Engineer",
        "company": "Google",
        "location": "Mountain View, California",
        "salary": "150K - 200K",
        "jobType": "Full Time",
        "remote": false,
        "contact": {
            "phone": "123-456-7890",
            "email": "jobs@google.com",
            "address": "1600 Amphitheatre Parkway, Mountain View, CA 94043"
        },
        "education": "Bachelor's Degree in Computer Science or related field",
        "experience": "5+ years of experience in software engineering",
        "logo": "https://cdn.mos.cms.futurecdn.net/rjqJEKv6P9Yjy9d3KMGvp8.jpg",
        "jobDescription": "We are seeking a highly skilled software engineer to join our team and help develop new software products. The ideal candidate will have a strong background in software engineering, with experience developing complex software systems.",
        "jobResponsibility": "Develop new software products and applications. Collaborate with cross-functional teams to design and implement software solutions. Write clean, efficient, maintainable code. Debug and troubleshoot software defects and issues. Participate in code reviews and provide constructive feedback. Stay up-to-date with industry trends and technologies to ensure software products are cutting-edge.Contribute to software documentation, including technical specifications and user guides."
    },
    {
        "jobId": 2,
        "title": "Front-End Developer",
        "company": "Facebook",
        "location": "Menlo Park, California",
        "salary": "120K - 150K",
        "jobType": "Full Time",
        "remote": false,
        "contact": {
            "phone": "987-654-3210",
            "email": "jobs@facebook.com",
            "address": "1 Hacker Way, Menlo Park, CA 94025"
        },
        "education": "Bachelor's Degree in Computer Science or related field",
        "experience": "3+ years of experience in front-end development",
        "logo": "https://1000logos.net/wp-content/uploads/2016/11/Facebook-Logo-Meaning.jpg",
        "jobDescription": "We are seeking a talented front-end developer to join our team and help us build world-class web applications. The ideal candidate will have experience developing modern web applications using the latest front-end technologies.",
        "jobResponsibility": "Develop modern web applications using HTML, CSS, JavaScript, and front-end frameworks like React or Angular.Collaborate with UX/UI designers to implement visually appealing and user-friendly interfaces. Optimize web applications for performance and responsiveness. Troubleshoot and debug front-end issues and provide solutions. Stay up-to-date with front-end technologies and best practices. Collaborate with back-end developers and other stakeholders to ensure seamless integration between front-end and back-end systems. Participate in code reviews and provide feedback to improve code quality ."
    },
    {
        "jobId": 3,
        "title": "Back-End Developer",
        "company": "Amazon",
        "location": "Seattle, Washington",
        "salary": "130K - 170K",
        "jobType": "Full Time",
        "remote": true,
        "contact": {
            "phone": "123-456-7890",
            "email": "jobs@amazon.com",
            "address": "410 Terry Ave N, Seattle, WA 98109"
        },
        "education": "Bachelor's Degree in Computer Science or related field",
        "experience": "5+ years of experience in back-end development",
        "logo": "https://api.freelogodesign.org/assets/blog/img/20180911090509731amazon_logo_RGB.jpg",
        "jobDescription": "We are seeking a skilled back-end developer to help us build the next generation of our cloud services platform. The ideal candidate will have experience developing scalable, high-performance back-end systems.",
        "jobResponsibility": "Develop scalable, high-performance back-end systems using Java, Python, or Ruby.  Collaborate with front-end developers and other stakeholders to design and implement APIs and other back-end functionalities. Optimize back-end systems for performance, reliability, and scalability. Debug and troubleshoot back-end issues and provide solutions. Stay up-to-date with back-end technologies and best practices. Participate in code reviews and provide feedback to improve code quality. Collaborate with DevOps teams to deploy and manage back-end systems in production environments."
    },
    {
        "jobId": 4,
        "title": "Full-Stack Developer",
        "company": "Microsoft",
        "location": "Redmond, Washington",
        "salary": "140K - 180K",
        "jobType": "Full Time",
        "remote": true,
        "contact": {
            "phone": "987-654-3210",
            "email": "jobs@microsoft.com",
            "address": "1 Microsoft Way, Redmond, WA 98052"
        },
        "education": "Bachelor's Degree in Computer Science or related field",
        "experience": "5+ years of experience in full-stack development",
        "logo": "https://blogs.microsoft.com/wp-content/uploads/prod/2012/08/8867.Microsoft_5F00_Logo_2D00_for_2D00_screen.jpg",
        "jobDescription": "We are seeking a full-stack developer to help us build the next generation of our web applications. The ideal candidate will have experience developing both front-end and back-end systems and a passion for creating high-quality user experiences.",
        "jobResponsibility": "Develop both front-end and back-end systems for web applications using HTML, CSS, JavaScript, Node.js, Python, or Ruby on Rails. Collaborate with UX/UI designers to implement visually appealing and user-friendly interfaces. Optimize web applications for performance, security, and scalability. Troubleshoot and debug both front-end and back-end issues and provide solutions. Stay up-to-date with full-stack technologies and best practices. Participate in code reviews and provide feedback to improve code quality.Collaborate with DevOps teams to deploy and manage web applications in production environments."
    },
    {
        "jobId": 5,
        "title": "Data Scientist",
        "company": "Netflix",
        "location": "Los Gatos, California",
        "salary": "150K - 200K",
        "jobType": "Full Time",
        "remote": false,
        "contact": {
            "phone": "987-654-3210",
            "email": "jobs@netflix.com",
            "address": "Netflix Headquarters, 100 Winchester Circle, Los Gatos, CA 95032, USA"
        },
        "education": "Master's Degree in Computer Science, Statistics, or related field",
        "experience": "3+ years of experience in data science or related field",
        "logo": "http://t1.gstatic.com/images?q=tbn:ANd9GcTDtWF5XSjCv2sKbO5Aq_L9UjMZ5_EFDrgkOdaMeCxo0eIRi979",
        "jobDescription": "We are seeking a talented data scientist to help us analyze and understand customer behavior and improve our recommendations engine. The ideal candidate will have experience with statistical modeling, machine learning, and big data technologies.",
        "jobResponsibility": "Analyze and understand customer behavior and preferences using statistical modeling, machine learning, and big data technologies. Develop and implement algorithms and models to improve the recommendations engine. Collaborate with cross-functional teams, including data engineers and product managers, to identify and address business challenges using data-driven approaches. Clean, preprocess, and analyze large datasets to derive insights and make recommendations for product improvements. Stay up-to-date with data science and machine learning advancements and apply them to solve business problems. Communicate findings and insights to stakeholders and provide recommendations for actions. Collaborate with DevOps teams to deploy and manage data science models in production environments ."
    },
    {
        "jobId": 6,
        "title": "Product Manager",
        "company": "Apple",
        "location": "Cupertino, California",
        "salary": "160K - 200K",
        "jobType": "Full Time",
        "remote": false,
        "contact": {
            "phone": "123-456-7890",
            "email": "jobs@apple.com",
            "address": "1 Apple Park Way, Cupertino, CA 95014"
        },
        "education": "Bachelor's Degree in Computer Science, Engineering, or related field",
        "experience": "5+ years of experience in product management or related field",
        "logo": "https://www.annualreports.com/HostedData/CompanyLogos/NASDAQ_AAPL.png",
        "jobDescription": "We are seeking a talented product manager to help us define and drive the development of new products. The ideal candidate will have experience leading cross-functional teams and a passion for creating products that delight customers.",
        "jobResponsibility": "Define product vision, strategy, and roadmap based on market research, customer feedback, and business objectives. Collaborate with cross-functional teams, including engineering, design, marketing, and finance, to develop and launch successful products. Conduct market research to identify customer needs, market trends, and competitors' offerings. Develop product requirements, user stories, and specifications to guide product development. Define and track key performance indicators (KPIs) to measure product success and make data-driven decisions. Gather and incorporate feedback from customers, stakeholders, and internal teams to continuously improve products.Develop go-to-market plans, including pricing, positioning, and marketing strategies, to drive product adoption and revenue growth."
    },
    {
        "jobId": 7,
        "title": "UX Designer",
        "company": "Airbnb",
        "location": "San Francisco, California",
        "salary": "120K - 150K",
        "jobType": "Full Time",
        "remote": true,
        "contact": {
            "phone": "123-456-7890",
            "email": "jobs@airbnb.com",
            "address": "888 Brannan St, San Francisco, CA 94103"
        },
        "education": "Bachelor's Degree in Design or related field",
        "experience": "3+ years of experience in UX design or related field",
        "logo": "https://www.digital.ink/wp-content/uploads/airbnb_logo_detail.jpg",
        "jobDescription": "We are seeking a talented UX designer to help us create delightful user experiences across our web and mobile platforms. The ideal candidate will have experience with user research, prototyping, and design systems.",
        "jobResponsibility": "Collaborating with cross-functional teams, including product managers, engineers, and researchers, to define and shape the user experience of Airbnb's digital products. Conducting user research, usability testing, and user feedback sessions to gather insights and understand user needs, behaviors, and pain points. Creating wireframes, prototypes, and mockups to visualize and communicate design concepts and solutions to stakeholders. Designing intuitive and visually appealing user interfaces that align with Airbnb's brand guidelines and design principles. Applying human-centered design principles to create user-centric experiences that are accessible, inclusive, and delightful. Iterating on designs based on feedback, user testing results, and data-driven insights to continuously improve the user experience. Collaborating with developers to ensure the seamless implementation of designs, and providing guidance on interaction and visual design details. Participating in design critiques and providing constructive feedback to peers to improve design quality and consistency. Keeping up-to-date with industry trends, best practices, and emerging technologies in UX/UI design, and incorporating them into your work. Contributing to design documentation, including design patterns, style guides, and design specifications, to ensure consistency and scalability across products. Advocating for the user and promoting a user-centric design culture within the organization."
    },
    {
        "jobId": 8,
        "title": "Product Manager",
        "company": "Apple",
        "location": "Cupertino, California",
        "salary": "150K - 200K",
        "jobType": "Full Time",
        "remote": false,
        "contact": {
            "phone": "1-800-676-2775",
            "email": "jobs@apple.com",
            "address": "1 Apple Park Way, Cupertino, CA 95014"
        },
        "education": "Bachelor's Degree in Business Administration or related field",
        "experience": "5+ years of experience in product management",
        "logo": "https://www.annualreports.com/HostedData/CompanyLogos/NASDAQ_AAPL.png",
        "jobDescription": "We are seeking a talented product manager to lead the development of new products and features for our world-class hardware and software products. The ideal candidate will have experience managing products through their entire lifecycle, from ideation to launch.",
        "jobResponsibility": "Define product vision, strategy, and roadmap based on market research, customer feedback, and business objectives. Collaborate with cross-functional teams, including engineering, design, marketing, and finance, to develop and launch successful products. Conduct market research to identify customer needs, market trends, and competitors' offerings. Develop product requirements, user stories, and specifications to guide product development. Define and track key performance indicators (KPIs) to measure product success and make data-driven decisions. Gather and incorporate feedback from customers, stakeholders, and internal teams to continuously improve products.Develop go-to-market plans, including pricing, positioning, and marketing strategies, to drive product adoption and revenue growth."
    },
    {
        "jobId": 9,
        "title": "Data Scientist",
        "company": "Netflix",
        "location": "Los Gatos, California",
        "salary": "150K - 200K",
        "jobType": "Full Time",
        "remote": false,
        "contact": {
            "phone": "987-654-3210",
            "email": "jobs@netflix.com",
            "address": "Netflix Headquarters, 100 Winchester Circle, Los Gatos, CA 95032, USA"
        },
        "education": "Master's Degree in Computer Science, Statistics, or related field",
        "experience": "3+ years of experience in data science",
        "logo": "http://t1.gstatic.com/images?q=tbn:ANd9GcTDtWF5XSjCv2sKbO5Aq_L9UjMZ5_EFDrgkOdaMeCxo0eIRi979",
        "jobDescription": "We are seeking a data scientist to help us build and improve our recommendation algorithms and other data-driven systems. The ideal candidate will have experience working with large datasets and a strong background in statistics and machine learning.",
        "jobResponsibility": "Analyze and understand customer behavior and preferences using statistical modeling, machine learning, and big data technologies. Develop and implement algorithms and models to improve the recommendations engine. Collaborate with cross-functional teams, including data engineers and product managers, to identify and address business challenges using data-driven approaches. Clean, preprocess, and analyze large datasets to derive insights and make recommendations for product improvements. Stay up-to-date with data science and machine learning advancements and apply them to solve business problems. Communicate findings and insights to stakeholders and provide recommendations for actions. Collaborate with DevOps teams to deploy and manage data science models in production environments ."
    },
    {
        "jobId": 10,
        "title": "Marketing Manager",
        "company": "Nike",
        "location": "Beaverton, Oregon",
        "salary": "120K - 150K",
        "jobType": "Full Time",
        "remote": false,
        "contact": {
            "phone": "123-456-7890",
            "email": "jobs@nike.com",
            "address": "Nike Headquarters, One Bowerman Drive, Beaverton, OR 97005, USA"
        },
        "education": "Bachelor's Degree in Marketing or related field",
        "experience": "5+ years of experience in marketing",
        "logo": "https://shadeglobal.files.wordpress.com/2019/05/nike-inc.-logo.jpg?w=640",
        "jobDescription": "We are seeking a creative and strategic marketing manager to lead our brand and product marketing efforts. The ideal candidate will have experience developing and executing integrated marketing campaigns across multiple channels.",
        "jobResponsibility": "Developing and implementing marketing strategies and campaigns to drive brand awareness, engagement, and sales for Nike products. Conducting market research and analysis to identify consumer trends, competitive landscape, and opportunities for growth. Creating and executing integrated marketing plans, including digital marketing, social media, email marketing, content marketing, and experiential marketing, to reach target audiences and achieve marketing goals. Managing and coordinating marketing campaigns and initiatives across multiple channels, including print, digital, social media, and events, to ensure consistent messaging and brand identity. Collaborating with internal and external partners, such as creative agencies, media agencies, and cross-functional teams, to execute marketing initiatives and optimize performance. Analyzing marketing performance metrics, such as website traffic, conversion rates, engagement rates, and ROI, to measure the effectiveness of marketing efforts and make data-driven decisions.Managing budgets and resources effectively to ensure efficient allocation of marketing spend and resources."
    }
]